hathach/tinyusb/src/portable/wch/hcd_ch32_usbfs.c
/*
 * SPDX-FileCopyrightText: Copyright (c) 2024 Mitsumine Suzu (verylowfreq)
 * SPDX-FileCopyrightText: Copyright (c) 2024 Ha Thach (tinyusb.org)
 * SPDX-FileCopyrightText: Copyright (c) 2026 Zhenjiang Zhang
 * SPDX-License-Identifier: MIT
 *
 * This file is part of the TinyUSB stack.
 *
 * CH32V20x USBFS host controller driver, SOF-paced.
 *
 * The USBFS SIE executes one transaction immediately when HOST_EP_PID is
 * written, with no frame-boundary alignment. An isochronous endpoint that is
 * re-submitted on completion is therefore polled at the task-loop rate rather
 * than once per 1 ms USB frame. This driver paces isochronous transfers with
 * the SOF interrupt: each ISO endpoint is allowed at most one transaction per
 * USB frame, armed from the SOF tick and from the ISO completion handler.
 */

#include "tusb_option.h"

#if CFG_TUH_ENABLED && defined(TUP_USBIP_WCH_USBFS) && defined(CFG_TUH_WCH_USBIP_USBFS) && CFG_TUH_WCH_USBIP_USBFS

  #include <stdlib.h>
  #include <string.h>

  #include "host/hcd.h"
  #include "host/usbh.h"
  #include "host/usbh_pvt.h"

  #include "bsp/board_api.h"

  #ifdef __GNUC__
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wstrict-prototypes"
  #endif

  #include "ch32v20x.h"

  #ifdef __GNUC__
    #pragma GCC diagnostic pop
  #endif

  #include "ch32v20x_usb.h"

  // Internal DMA buffers, used only for transfers without an application buffer
  // (setup packet, control status stage, clear-stall). Data transfers point the
  // DMA directly at the application buffer (see hardware_start_xfer): these
  // 64-byte buffers would be overflowed by larger packets (e.g. FS ISO up to
  // 1023 bytes), smashing adjacent statistics such as the endpoint record table.
  #define USBFS_RX_BUF_LEN 64
  #define USBFS_TX_BUF_LEN 64
TU_ATTR_ALIGNED(4) static uint8_t USBFS_RX_Buf[USBFS_RX_BUF_LEN];
TU_ATTR_ALIGNED(4) static uint8_t USBFS_TX_Buf[USBFS_TX_BUF_LEN];

  #define USB_XFER_TIMEOUT_MILLIS 100

  #define PANIC(...)                            \
    do {                                        \
      printf("%s() L%d: ", __func__, __LINE__); \
      printf("\r\n[PANIC] " __VA_ARGS__);       \
      while (true) {}                           \
    } while (false)

  #define LOG_CH32_USBFSH(...) TU_LOG3(__VA_ARGS__)

// Busywait for delay microseconds/nanoseconds
TU_ATTR_ALWAYS_INLINE static inline void loopdelay(uint32_t count) {
  volatile uint32_t c = count / 3;
  if (c == 0) {
    return;
  }
  asm volatile("1:                     \n" // loop label
               "    addi  %0, %0, -1   \n" // c--
               "    bne   %0, zero, 1b \n" // if (c != 0) goto loop
               : "+r"(c)                   // c is input/output operand
  );
}

//--------------------------------------------------------------------+
// Endpoint record
//--------------------------------------------------------------------+

// Per-endpoint state. One record per opened (dev_addr, ep_addr). ISO endpoints
// carry a one-slot pending queue (iso_queued/iso_buf/iso_len) plus the frame
// gate (iso_last_frame) so that an early same-frame re-submission does not
// grab the single in-flight slot and starve the other direction.
typedef struct usb_edpt {
  bool configured;

  uint8_t  dev_addr;
  uint8_t  ep_addr;   // full address including direction bit
  uint16_t max_packet_size;
  uint8_t  xfer_type; // TUSB_XFER_*

  // Data toggle (0 or 1) for DATA0/1. Never used for ISO.
  uint8_t data_toggle;

  // ISO pending queue: written from task context (hcd_edpt_xfer), drained by
  // the SOF/TRANSFER ISR. iso_active marks the endpoint that currently owns
  // the in-flight slot.
  bool     iso_queued;
  bool     iso_active;
  uint8_t *iso_buf;
  uint16_t iso_len;
  uint16_t iso_last_frame; // frame in which this endpoint was last armed

  // NAK retry stash (non-ISO control/bulk). Re-armed once per frame from the
  // SOF ISR (arm_nak_retry) so a NAK'd control transfer is retried with 1 ms
  // backoff, not hammered in a tight task loop (which floods the device's
  // control endpoint and starves the bus + main loop).
  bool     is_nak_pending;
  uint16_t nak_last_frame;
  uint16_t nak_xferred;
  uint8_t  nak_backoff; // frames to wait before the next NAK retry (progressive)
  uint16_t buflen;
  uint8_t *buf;
} usb_edpt_t;

static usb_edpt_t usb_edpt_list[CFG_TUH_DEVICE_MAX * CFG_TUH_ENDPOINT_MAX] = {};

// In-flight transfer: the SIE executes one transaction at a time. xfer_type is
// a snapshot taken at arm time so the completion ISR routes by what was
// actually armed, not by the (possibly reused) record.
typedef struct usb_current_xfer_st {
  bool     is_busy;
  uint8_t  dev_addr;
  uint8_t  ep_addr;
  uint8_t  xfer_type; // snapshot at arm time
  uint32_t start_ms;
  uint8_t *buffer;
  uint16_t bufferlen;
  uint16_t xferred_len;
} usb_current_xfer_t;

static volatile usb_current_xfer_t usb_current_xfer_info = {};

// Software SOF frame counter (no readable frame-number register exists on
// USBFSH). Incremented in the SOF ISR; hcd_frame_number() returns it.
static volatile uint16_t g_sof_frame = 0;

static bool interrupt_enabled = false;

// Set while a port reset is in progress: the USBFS hardware can assert a
// DETECT(attach=0) edge while the bus is in reset (SE0). The stack's event
// loop may re-enable the IRQ between hcd_port_reset() and hcd_port_reset_end()
// (OSAL queue ops toggle the interrupt), so DETECT edges must be ignored
// during that window and only the flag cleared. Otherwise the reset edge is
// reported as a device removal and kills the enumeration.
static bool port_reset_in_progress  = false;
static bool int_state_for_portreset = false;

static usb_edpt_t *get_edpt_record(uint8_t dev_addr, uint8_t ep_addr) {
  for (size_t i = 0; i < TU_ARRAY_SIZE(usb_edpt_list); i++) {
    usb_edpt_t *cur = &usb_edpt_list[i];
    if (cur->configured && cur->dev_addr == dev_addr && cur->ep_addr == ep_addr) {
      return cur;
    }
  }
  return NULL;
}

static usb_edpt_t *get_empty_record_slot(void) {
  for (size_t i = 0; i < TU_ARRAY_SIZE(usb_edpt_list); i++) {
    if (!usb_edpt_list[i].configured) {
      return &usb_edpt_list[i];
    }
  }
  return NULL;
}

