hathach/tinyusb/src/portable/wch/hcd_ch32_usbfs.c
static usb_edpt_t *add_edpt_record(uint8_t dev_addr, uint8_t ep_addr, uint16_t max_packet_size, uint8_t xfer_type) {
  usb_edpt_t *slot = get_empty_record_slot();
  TU_ASSERT(slot != NULL, NULL);

  slot->dev_addr        = dev_addr;
  slot->ep_addr         = ep_addr;
  slot->max_packet_size = max_packet_size;
  slot->xfer_type       = xfer_type;
  slot->data_toggle     = 0;
  slot->is_nak_pending  = false;
  slot->nak_last_frame  = 0;
  slot->nak_xferred     = 0;
  slot->nak_backoff     = 1;
  slot->buflen          = 0;
  slot->buf             = NULL;
  slot->iso_queued      = false;
  slot->iso_active      = false;
  slot->iso_buf         = NULL;
  slot->iso_len         = 0;
  slot->iso_last_frame  = 0;

  slot->configured = true;

  return slot;
}

static usb_edpt_t *get_or_add_edpt_record(uint8_t dev_addr, uint8_t ep_addr, uint16_t max_packet_size,
                                          uint8_t xfer_type) {
  usb_edpt_t *ret = get_edpt_record(dev_addr, ep_addr);
  if (ret != NULL) {
    return ret;
  }
  return add_edpt_record(dev_addr, ep_addr, max_packet_size, xfer_type);
}

static void remove_edpt_record_for_device(uint8_t dev_addr) {
  for (size_t i = 0; i < TU_ARRAY_SIZE(usb_edpt_list); i++) {
    if (usb_edpt_list[i].configured && usb_edpt_list[i].dev_addr == dev_addr) {
      usb_edpt_list[i].configured = false;
    }
  }
}

// Briefly mask the USBFS IRQ to make task-context reads/writes of state shared
// with the ISR atomic. Save/restore the previous enabled state. Do NOT call
// from within the USBFS ISR (it is already non-preemptible for this IRQ).
static bool usbfs_irq_save(void) {
  bool prev = interrupt_enabled;
  NVIC_DisableIRQ(USBFS_IRQn);
  return prev;
}

static void usbfs_irq_restore(bool prev) {
  if (prev) {
    NVIC_EnableIRQ(USBFS_IRQn);
  }
}

//--------------------------------------------------------------------+
// Hardware helpers
//--------------------------------------------------------------------+

/** Enable or disable USBFS Host function */
static void hardware_init_host(bool enabled) {
  // Reset USBOTG module
  USBOTG_H_FS->BASE_CTRL = USBFS_UC_RESET_SIE | USBFS_UC_CLR_ALL;

  tusb_time_delay_ms_api(1);
  USBOTG_H_FS->BASE_CTRL = 0;

  if (!enabled) {
    USBOTG_H_FS->BASE_CTRL = 0;
  } else {
    hcd_int_disable(0);
    USBOTG_H_FS->BASE_CTRL   = USBFS_UC_HOST_MODE | USBFS_UC_INT_BUSY | USBFS_UC_DMA_EN;
    USBOTG_H_FS->HOST_EP_MOD = USBFS_UH_EP_TX_EN | USBFS_UH_EP_RX_EN;
    USBOTG_H_FS->HOST_RX_DMA = (uint32_t)USBFS_RX_Buf;
    USBOTG_H_FS->HOST_TX_DMA = (uint32_t)USBFS_TX_Buf;
    // DETECT for connect/disconnect, TRANSFER for completions, HST_SOF for
    // the 1ms frame tick that paces isochronous transfers. UIE_TRANSFER stays
    // enabled for the driver's lifetime (no disable/re-enable per transaction).
    USBOTG_H_FS->INT_EN = USBFS_UIE_DETECT | USBFS_UIE_TRANSFER | USBFS_UIE_HST_SOF;
  }
}

// Arm one transaction. The DMA and transfer length are read from the in-flight
// slot; the caller (control/bulk path or arm_iso_drain) sets those first. For
// OUT the caller must pre-write HOST_TX_LEN. is_iso selects the no-handshake
// bit: IN expects no ACK (R_RES on HOST_RX_CTRL), OUT sends no handshake
// (T_RES on HOST_TX_CTRL). Control/setup transfers leave both RES bits clear
// (ACK expected). Writing HOST_EP_PID kicks the SIE immediately; the flag
// clear that follows is the "go" — see the STOP-before-clear rule in
// hcd_int_handler for why the ISR must not clear this flag while HOST_EP_PID
// is still set.
static bool hardware_start_xfer(uint8_t pid, uint8_t ep_addr, uint8_t data_toggle, bool is_iso) {
  LOG_CH32_USBFSH("hardware_start_xfer(pid=%s(0x%02x), ep_addr=0x%02x, toggle=%d, iso=%d)\r\n",
                  pid == USB_PID_IN      ? "IN"
                  : pid == USB_PID_OUT   ? "OUT"
                  : pid == USB_PID_SETUP ? "SETUP"
                                         : "(other)",
                  pid, ep_addr, data_toggle, is_iso ? 1 : 0);

  // WORKAROUND: For LowSpeed device, insert small delay
  bool is_lowspeed_device = tuh_speed_get(usb_current_xfer_info.dev_addr) == TUSB_SPEED_LOW;
  if (is_lowspeed_device) {
    loopdelay(SystemCoreClock / 1000000 * 40);
  }

  // Point the DMA at the transfer buffer itself: the fixed internal TX/RX
  // buffers are only 64 bytes and would be overflowed by larger packets
  // (e.g. 192-byte FS isochronous packets). Zero-length transfers (control
  // status stage, buffer == NULL) fall back to the internal buffer.
  if (pid == USB_PID_IN) {
    USBOTG_H_FS->HOST_RX_DMA =
      (uint32_t)(usb_current_xfer_info.buffer != NULL ? usb_current_xfer_info.buffer : (uint8_t *)USBFS_RX_Buf);
  } else {
    USBOTG_H_FS->HOST_TX_DMA =
      (uint32_t)(usb_current_xfer_info.buffer != NULL ? usb_current_xfer_info.buffer : (uint8_t *)USBFS_TX_Buf);
  }

  uint8_t ep_num   = tu_edpt_number(ep_addr);
  uint8_t pid_edpt = (pid << 4) | (ep_num & 0x0f);
  // Assigning (not OR-ing) the control registers clears the RES bits, so
  // control/setup transfers get ACK-expected behavior.
  USBOTG_H_FS->HOST_TX_CTRL = (data_toggle != 0) ? USBFS_UH_T_TOG : 0;
  USBOTG_H_FS->HOST_RX_CTRL = (data_toggle != 0) ? USBFS_UH_R_TOG : 0;
  if (is_iso) {
    if (pid == USB_PID_IN) {
      USBOTG_H_FS->HOST_RX_CTRL |= USBFS_UH_R_RES; // ISO IN: no handshake
    } else {
      USBOTG_H_FS->HOST_TX_CTRL |= USBFS_UH_T_RES; // ISO OUT: no handshake
    }
  }
  USBOTG_H_FS->HOST_EP_PID = pid_edpt;             // kick the SIE
  USBOTG_H_FS->INT_FG      = USBFS_UIF_TRANSFER;   // clear any stale flag = "go"
  return true;
}

/** Set device address to communicate */
static void hardware_update_device_address(uint8_t dev_addr) {
  // Keep the bit of GP_BIT. Other 7bits are actual device address.
  USBOTG_H_FS->DEV_ADDR = (USBOTG_H_FS->DEV_ADDR & USBFS_UDA_GP_BIT) | (dev_addr & USBFS_USB_ADDR_MASK);
}

/** Set port speed */
static void hardware_update_port_speed(tusb_speed_t speed) {
  LOG_CH32_USBFSH("hardware_update_port_speed(%s)\r\n", speed == TUSB_SPEED_FULL  ? "Full"
                                                        : speed == TUSB_SPEED_LOW ? "Low"
                                                                                  : "(invalid)");
  switch (speed) {
    case TUSB_SPEED_LOW:
      USBOTG_H_FS->BASE_CTRL |= USBFS_UC_LOW_SPEED;
      USBOTG_H_FS->HOST_CTRL |= USBFS_UH_LOW_SPEED;
      USBOTG_H_FS->HOST_SETUP |= USBFS_UH_PRE_PID_EN;
      return;
    case TUSB_SPEED_FULL:
      USBOTG_H_FS->BASE_CTRL &= ~USBFS_UC_LOW_SPEED;
      USBOTG_H_FS->HOST_CTRL &= ~USBFS_UH_LOW_SPEED;
      USBOTG_H_FS->HOST_SETUP &= ~USBFS_UH_PRE_PID_EN;
      return;
    default:
      PANIC("hardware_update_port_speed(%d)\r\n", speed);
  }
}

static void hardware_set_port_address_speed(uint8_t dev_addr) {
  hardware_update_device_address(dev_addr);
  tusb_speed_t rhport_speed = hcd_port_speed_get(0);
  tusb_speed_t dev_speed    = tuh_speed_get(dev_addr);
  hardware_update_port_speed(dev_speed);
  if (rhport_speed == TUSB_SPEED_FULL && dev_speed == TUSB_SPEED_LOW) {
    USBOTG_H_FS->HOST_CTRL &= ~USBFS_UH_LOW_SPEED;
  }
}

static bool hardware_device_attached(void) {
  return USBOTG_H_FS->MIS_ST & USBFS_UMS_DEV_ATTACH;
}

//--------------------------------------------------------------------+
// SOF-paced isochronous scheduling
//--------------------------------------------------------------------+

// Arm one queued, frame-due ISO endpoint into the in-flight slot. Called from
// the SOF ISR (in_isr=true), the ISO completion ISR (in_isr=true), and
// hcd_edpt_xfer's ISO branch (in_isr=false). When called from task context
// the slot publish is guarded against the ISR; from the ISR no guard is needed
// (the single USBFS IRQ cannot preempt itself). At most one endpoint is armed
// per call (single-transaction SIE); a second due endpoint is armed from the
// completion of the first, yielding one IN + one OUT per frame.
static void arm_iso_drain(bool in_isr) {
  if (usb_current_xfer_info.is_busy) {
    return;
  }

  bool prev = in_isr ? false : usbfs_irq_save();

  usb_edpt_t *best = NULL;
  if (!usb_current_xfer_info.is_busy) {
    for (size_t i = 0; i < TU_ARRAY_SIZE(usb_edpt_list); i++) {
      usb_edpt_t *cur = &usb_edpt_list[i];
      if (cur->configured && cur->xfer_type == TUSB_XFER_ISOCHRONOUS && cur->iso_queued && !cur->iso_active &&
          cur->iso_last_frame != g_sof_frame) {
        best = cur;
        break;
      }
    }
  }

  uint8_t  arm_dev = 0;
  uint8_t  arm_ep  = 0;
  uint16_t arm_len = 0;
  bool     arm_in  = false;
  bool     armed   = false;

  if (best != NULL) {
    // Publish the in-flight slot from the endpoint's queued request.
    usb_current_xfer_info.is_busy     = true;
    usb_current_xfer_info.dev_addr    = best->dev_addr;
    usb_current_xfer_info.ep_addr     = best->ep_addr;
    usb_current_xfer_info.xfer_type   = TUSB_XFER_ISOCHRONOUS;
    usb_current_xfer_info.buffer      = best->iso_buf;
    usb_current_xfer_info.bufferlen   = best->iso_len;
    usb_current_xfer_info.xferred_len = 0;
    usb_current_xfer_info.start_ms    = tusb_time_millis_api();

