hathach/tinyusb/src/portable/wch/hcd_ch32_usbfs.c
    best->iso_active     = true;
    best->iso_queued     = false;
    best->iso_last_frame = g_sof_frame;

    arm_dev = best->dev_addr;
    arm_ep  = best->ep_addr;
    arm_len = best->iso_len;
    arm_in  = (tu_edpt_dir(best->ep_addr) == TUSB_DIR_IN);
    armed   = true;
  }

  if (!in_isr) {
    usbfs_irq_restore(prev);
  }

  if (armed) {
    // is_busy is set, so no other arm path can race the HOST_EP_PID write.
    hardware_set_port_address_speed(arm_dev);
    if (arm_in) {
      hardware_start_xfer(USB_PID_IN, arm_ep, 0, true);
    } else {
      USBOTG_H_FS->HOST_TX_LEN = arm_len;
      hardware_start_xfer(USB_PID_OUT, arm_ep, 0, true);
    }
  }
}

// Re-arm a NAK'd control/bulk transfer once per USB frame (1 ms backoff) so the
// device has time to finish processing. Called from the SOF ISR, ahead of ISO,
// so a NAK'd control transfer (e.g. a SET_CUR status stage) makes progress even
// while a non-ISO transfer is in flight. At most one endpoint is armed per
// call (single SIE).
static void arm_nak_retry(void) {
  if (usb_current_xfer_info.is_busy) {
    return;
  }
  usb_edpt_t *best = NULL;
  for (size_t i = 0; i < TU_ARRAY_SIZE(usb_edpt_list); i++) {
    usb_edpt_t *cur = &usb_edpt_list[i];
    if (cur->configured && cur->is_nak_pending && (uint16_t)(g_sof_frame - cur->nak_last_frame) >= cur->nak_backoff &&
        (cur->xfer_type == TUSB_XFER_CONTROL || cur->xfer_type == TUSB_XFER_BULK)) {
      best = cur;
      break;
    }
  }
  if (best == NULL) {
    return;
  }
  uint8_t pid                       = (tu_edpt_dir(best->ep_addr) == TUSB_DIR_IN) ? USB_PID_IN : USB_PID_OUT;
  bool    prev                      = usbfs_irq_save();
  usb_current_xfer_info.is_busy     = true;
  usb_current_xfer_info.dev_addr    = best->dev_addr;
  usb_current_xfer_info.ep_addr     = best->ep_addr;
  usb_current_xfer_info.xfer_type   = best->xfer_type;
  usb_current_xfer_info.buffer      = best->buf;
  usb_current_xfer_info.bufferlen   = best->buflen;
  usb_current_xfer_info.xferred_len = best->nak_xferred;
  usb_current_xfer_info.start_ms    = tusb_time_millis_api();
  best->is_nak_pending              = false;
  best->nak_last_frame              = g_sof_frame;
  usbfs_irq_restore(prev);

  hardware_set_port_address_speed(best->dev_addr);
  if (pid == USB_PID_IN) {
    hardware_start_xfer(USB_PID_IN, best->ep_addr, best->data_toggle, false);
  } else {
    USBOTG_H_FS->HOST_TX_LEN = TU_MIN(best->max_packet_size, best->buflen);
    hardware_start_xfer(USB_PID_OUT, best->ep_addr, best->data_toggle, false);
  }
}

// ISO transfer completion. ISO has no handshake (no NAK/STALL): every armed
// transaction completes successfully. RX_LEN holds received bytes for IN;
// for OUT the whole queued packet was sent.
static void iso_transfer_complete(uint8_t request_pid, usb_edpt_t *edpt) {
  uint16_t done_len = (request_pid == USB_PID_IN) ? (uint16_t)USBOTG_H_FS->RX_LEN : usb_current_xfer_info.bufferlen;
  uint8_t  dev_addr = usb_current_xfer_info.dev_addr;
  uint8_t  ep_addr  = usb_current_xfer_info.ep_addr;

  LOG_CH32_USBFSH("ISO %s completed %d bytes\r\n", request_pid == USB_PID_IN ? "IN" : "OUT", done_len);

  // Clear the slot BEFORE posting the completion event: the class re-submits
  // from the completion handler in task context, and a stuck is_busy would
  // make that re-submit's drain bounce.
  bool prev                     = usbfs_irq_save();
  usb_current_xfer_info.is_busy = false;
  edpt->iso_active              = false;
  usbfs_irq_restore(prev);

  hcd_event_xfer_complete(dev_addr, ep_addr, done_len, XFER_RESULT_SUCCESS, true);

  // Let the other direction's queued ISO fire in the same frame.
  arm_iso_drain(true);
}

// Control/bulk/interrupt transfer completion. Reached only when the in-flight
// slot's xfer_type snapshot is not ISO (the hard routing rule in
// hcd_int_handler). Preserves the working multi-packet and NAK/STALL logic.
static void cb_transfer_complete(uint8_t request_pid, uint8_t response_pid, usb_edpt_t *edpt, bool in_isr) {
  uint8_t dev_addr = usb_current_xfer_info.dev_addr;
  uint8_t ep_addr  = usb_current_xfer_info.ep_addr;

  if (USBOTG_H_FS->INT_ST & USBFS_UIS_TOG_OK) {
    // Toggle tracked only for non-ISO (ISO never reaches here).
    edpt->data_toggle ^= 0x01;

    switch (request_pid) {
      case USB_PID_SETUP:
      case USB_PID_OUT: {
        uint16_t tx_len = USBOTG_H_FS->HOST_TX_LEN;
        usb_current_xfer_info.bufferlen -= tx_len;
        usb_current_xfer_info.xferred_len += tx_len;
        if (usb_current_xfer_info.bufferlen == 0) {
          LOG_CH32_USBFSH("USB_PID_%s completed %d bytes\r\n", request_pid == USB_PID_OUT ? "OUT" : "SETUP",
                          usb_current_xfer_info.xferred_len);
          bool prev                     = usbfs_irq_save();
          usb_current_xfer_info.is_busy = false;
          usbfs_irq_restore(prev);
          hcd_event_xfer_complete(dev_addr, ep_addr, usb_current_xfer_info.xferred_len, XFER_RESULT_SUCCESS, in_isr);
          return;
        }
        LOG_CH32_USBFSH("USB_PID_OUT continue...\r\n");
        usb_current_xfer_info.buffer += tx_len;
        uint16_t copylen         = TU_MIN(edpt->max_packet_size, usb_current_xfer_info.bufferlen);
        USBOTG_H_FS->HOST_TX_LEN = copylen; // DMA reads directly from usb_current_xfer_info.buffer
        hardware_start_xfer(USB_PID_OUT, ep_addr, edpt->data_toggle, false);
        return;
      }
      case USB_PID_IN: {
        uint16_t received_len = USBOTG_H_FS->RX_LEN;
        usb_current_xfer_info.xferred_len += received_len;
        uint16_t xferred_len = usb_current_xfer_info.xferred_len;
        LOG_CH32_USBFSH("Read %d bytes\r\n", received_len);
        if (usb_current_xfer_info.buffer != NULL) {
          usb_current_xfer_info.buffer += received_len;
        }
        if ((received_len < edpt->max_packet_size) || (xferred_len == usb_current_xfer_info.bufferlen)) {
          LOG_CH32_USBFSH("USB_PID_IN completed\r\n");
          bool prev                     = usbfs_irq_save();
          usb_current_xfer_info.is_busy = false;
          usbfs_irq_restore(prev);
          hcd_event_xfer_complete(dev_addr, ep_addr, xferred_len, XFER_RESULT_SUCCESS, in_isr);
          return;
        }
        LOG_CH32_USBFSH("Read more data\r\n");
        hardware_start_xfer(USB_PID_IN, ep_addr, edpt->data_toggle, false);
        return;
      }
      default: {
        LOG_CH32_USBFSH("cb_transfer_complete() unexpected response PID: 0x%02x\r\n", response_pid);
        bool prev                     = usbfs_irq_save();
        usb_current_xfer_info.is_busy = false;
        usbfs_irq_restore(prev);
        hcd_event_xfer_complete(dev_addr, ep_addr, 0, XFER_RESULT_FAILED, in_isr);
        return;
      }
    }
  }

  // No TOG_OK: handshake/timeout handling.
  if (response_pid == USB_PID_STALL) {
    LOG_CH32_USBFSH("STALL response\r\n");
    bool prev                     = usbfs_irq_save();
    usb_current_xfer_info.is_busy = false;
    usbfs_irq_restore(prev);
    hcd_event_xfer_complete(dev_addr, ep_addr, 0, XFER_RESULT_STALLED, in_isr);
    return;
  }

  if (response_pid == USB_PID_NAK) {
    LOG_CH32_USBFSH("NAK response\r\n");
    if (edpt->xfer_type == TUSB_XFER_INTERRUPT) {
      // Interrupt IN: a NAK means "no data yet"; report success (no bytes).
      bool prev                     = usbfs_irq_save();
      usb_current_xfer_info.is_busy = false;
      usbfs_irq_restore(prev);
      hcd_event_xfer_complete(dev_addr, ep_addr, 0, XFER_RESULT_SUCCESS, in_isr);
    } else {
      // Bulk/control NAK: stash for a SOF-driven retry with progressive backoff
      // (1->2->4...->64 frames). A tight task-loop retry floods the device's
      // endpoint ISR and starves its main loop (and ours); backing off lets the
      // device finish processing and ACK.
      bool prev                     = usbfs_irq_save();
      usb_current_xfer_info.is_busy = false;
      edpt->is_nak_pending          = true;
      edpt->buflen                  = usb_current_xfer_info.bufferlen;
      edpt->buf                     = usb_current_xfer_info.buffer;
      edpt->nak_xferred             = usb_current_xfer_info.xferred_len;
      edpt->nak_backoff             = TU_MIN(edpt->nak_backoff * 2, 64);
      usbfs_irq_restore(prev);
    }
    return;
  }

  if (response_pid == USB_PID_DATA0 || response_pid == USB_PID_DATA1) {
    LOG_CH32_USBFSH("Data toggle mismatched (DATA0/1 not via TOG_OK). RX_LEN=%d\r\n", USBOTG_H_FS->RX_LEN);
    bool prev                     = usbfs_irq_save();
    usb_current_xfer_info.is_busy = false;
    usbfs_irq_restore(prev);
    hcd_event_xfer_complete(dev_addr, ep_addr, 0, XFER_RESULT_FAILED, in_isr);
    return;
  }

  LOG_CH32_USBFSH("cb_transfer_complete() unexpected response PID: 0x%02x\r\n", response_pid);
  bool prev                     = usbfs_irq_save();
  usb_current_xfer_info.is_busy = false;
  usbfs_irq_restore(prev);
  hcd_event_xfer_complete(dev_addr, ep_addr, 0, XFER_RESULT_FAILED, in_isr);
}

//--------------------------------------------------------------------+
// HCD API
//--------------------------------------------------------------------+
bool hcd_init(uint8_t rhport, const tusb_rhport_init_t *rh_init) {
  (void)rhport;
  (void)rh_init;
  hardware_init_host(true);
  g_sof_frame = 0;
  return true;
}

bool hcd_deinit(uint8_t rhport) {
  (void)rhport;
  hardware_init_host(false);
  return true;
}

void hcd_port_reset(uint8_t rhport) {
  (void)rhport;
  LOG_CH32_USBFSH("hcd_port_reset()\r\n");
  port_reset_in_progress  = true;
  int_state_for_portreset = interrupt_enabled;
  hcd_int_disable(rhport);
  hardware_update_device_address(0x00);

  // Drop any in-flight / queued ISO so it does not resume after the reset.
  usb_current_xfer_info.is_busy = false;
  USBOTG_H_FS->HOST_EP_PID      = 0;

  USBOTG_H_FS->HOST_CTRL |= USBFS_UH_BUS_RESET;
}

void hcd_port_reset_end(uint8_t rhport) {
  (void)rhport;
  LOG_CH32_USBFSH("hcd_port_reset_end()\r\n");

  USBOTG_H_FS->HOST_CTRL &= ~USBFS_UH_BUS_RESET;
  tusb_time_delay_ms_api(2);

