hathach/tinyusb/src/portable/wch/hcd_ch32_usbfs.c
  if ((USBOTG_H_FS->HOST_CTRL & USBFS_UH_PORT_EN) == 0) {
    if (hcd_port_speed_get(0) == TUSB_SPEED_LOW) {
      hardware_update_port_speed(TUSB_SPEED_LOW);
    }
  }

  USBOTG_H_FS->HOST_CTRL |= USBFS_UH_PORT_EN;
  // SOF generation must be on: it both keeps the enumerated device from
  // suspending and drives the 1ms frame tick for isochronous pacing.
  USBOTG_H_FS->HOST_SETUP |= USBFS_UH_SOF_EN;

  // Suppress the attached event the reset itself may assert.
  USBOTG_H_FS->INT_FG |= USBFS_UIF_DETECT;

  // Port reset complete: resume normal DETECT event reporting.
  port_reset_in_progress = false;

  if (int_state_for_portreset) {
    hcd_int_enable(rhport);
  }
}

bool hcd_port_connect_status(uint8_t rhport) {
  (void)rhport;
  return hardware_device_attached();
}

tusb_speed_t hcd_port_speed_get(uint8_t rhport) {
  (void)rhport;
  if (USBOTG_H_FS->MIS_ST & USBFS_UMS_DM_LEVEL) {
    return TUSB_SPEED_LOW;
  }
  return TUSB_SPEED_FULL;
}

// Close all opened endpoints belonging to this device.
void hcd_device_close(uint8_t rhport, uint8_t dev_addr) {
  (void)rhport;
  LOG_CH32_USBFSH("hcd_device_close(0x%02x)\r\n", dev_addr);
  bool prev = usbfs_irq_save();
  // Drop an in-flight transfer if it belongs to this device.
  if (usb_current_xfer_info.is_busy && usb_current_xfer_info.dev_addr == dev_addr) {
    usb_current_xfer_info.is_busy = false;
    USBOTG_H_FS->HOST_EP_PID      = 0;
  }
  remove_edpt_record_for_device(dev_addr);
  usbfs_irq_restore(prev);
}

uint32_t hcd_frame_number(uint8_t rhport) {
  (void)rhport;
  return g_sof_frame;
}

void hcd_int_enable(uint8_t rhport) {
  (void)rhport;
  NVIC_EnableIRQ(USBFS_IRQn);
  interrupt_enabled = true;
}

void hcd_int_disable(uint8_t rhport) {
  (void)rhport;
  NVIC_DisableIRQ(USBFS_IRQn);
  interrupt_enabled = false;
}

void hcd_int_handler(uint8_t rhport, bool in_isr) {
  (void)rhport;
  uint8_t fg = USBOTG_H_FS->INT_FG;

  if (fg & USBFS_UIF_DETECT) {
    USBOTG_H_FS->INT_FG = USBFS_UIF_DETECT;
    // Ignore DETECT edges while a port reset is in progress (see
    // port_reset_in_progress): the reset asserts an attach=0 edge that is not
    // a real disconnect.
    if (port_reset_in_progress) {
      return;
    }
    bool attached = hardware_device_attached();
    LOG_CH32_USBFSH("hcd_int_handler() attached = %d\r\n", attached ? 1 : 0);
    if (attached) {
      hcd_event_device_attach(rhport, true);
    } else {
      // Drop any in-flight / queued ISO and NAK-pending state on disconnect.
      bool prev = usbfs_irq_save();
      usb_current_xfer_info.is_busy = false;
      USBOTG_H_FS->HOST_EP_PID      = 0;
      // Clear ISO and NAK-pending state for all endpoints so the SOF ISR
      // does not try to re-arm transfers for the detached device.
      for (size_t i = 0; i < TU_ARRAY_SIZE(usb_edpt_list); i++) {
        usb_edpt_t *edpt = &usb_edpt_list[i];
        if (edpt->configured) {
          edpt->iso_queued     = false;
          edpt->iso_active     = false;
          edpt->is_nak_pending = false;
        }
      }
      usbfs_irq_restore(prev);
      hcd_event_device_remove(rhport, true);
    }
    return;
  }

  // SOF: 1ms frame tick. Increment the software frame counter and try to arm
  // a queued, frame-due ISO endpoint. Fall through: a TRANSFER completion may
  // be pending in the same INT_FG snapshot and must be serviced here too.
  if (fg & USBFS_UIF_HST_SOF) {
    USBOTG_H_FS->INT_FG = USBFS_UIF_HST_SOF;
    g_sof_frame++;
    // ISO has priority over the NAK retry: isochronous transfers must keep
    // their 1/frame cadence even while a control transfer is NAKing (the retry
    // happens in the gaps). Reversing this starves ISO under a persistent
    // control NAK.

    // Check for transfer timeout on the in-flight slot.
    if (usb_current_xfer_info.is_busy) {
      uint32_t elapsed = tusb_time_millis_api() - usb_current_xfer_info.start_ms;
      if (elapsed > USB_XFER_TIMEOUT_MILLIS) {
        uint8_t dev_addr = usb_current_xfer_info.dev_addr;
        uint8_t ep_addr  = usb_current_xfer_info.ep_addr;
        LOG_CH32_USBFSH("Transfer timeout, dev=0x%02x, ep=0x%02x\r\n", dev_addr, ep_addr);
        // Clear any NAK-pending state so arm_nak_retry does not re-arm.
        usb_edpt_t *edpt = get_edpt_record(dev_addr, ep_addr);
        if (edpt != NULL) {
          edpt->is_nak_pending = false;
        }
        USBOTG_H_FS->HOST_EP_PID      = 0;
        usb_current_xfer_info.is_busy = false;
        hcd_event_xfer_complete(dev_addr, ep_addr, 0, XFER_RESULT_FAILED, true);
      }
    }

    arm_iso_drain(true);
    arm_nak_retry();
    // fall through
  }

  // Re-read INT_FG here rather than trust the entry snapshot: the SOF branch's
  // arm_iso_drain may have armed a transaction (clearing UIF_TRANSFER), in which
  // case there is no pending completion to service.
  if (USBOTG_H_FS->INT_FG & USBFS_UIF_TRANSFER) {
    // Stale-edge guard: only process a completion for a transfer we armed.
    // Clearing the flag while HOST_EP_PID is set re-arms the SIE, so STOP
    // (HOST_EP_PID = 0) BEFORE clearing the flag.
    if (!usb_current_xfer_info.is_busy) {
      USBOTG_H_FS->HOST_EP_PID = 0;
      USBOTG_H_FS->INT_FG      = USBFS_UIF_TRANSFER;
      return;
    }

    uint8_t pid_edpt     = USBOTG_H_FS->HOST_EP_PID;
    uint8_t status       = USBOTG_H_FS->INT_ST;
    uint8_t dev_addr     = USBOTG_H_FS->DEV_ADDR & USBFS_USB_ADDR_MASK;
    uint8_t request_pid  = pid_edpt >> 4;
    uint8_t response_pid = status & USBFS_UIS_H_RES_MASK;
    uint8_t ep_addr      = pid_edpt & 0x0f;
    if (request_pid == USB_PID_IN) {
      ep_addr |= 0x80;
    }

    // STOP first, then clear the flag (order prevents an extra SIE transaction).
    USBOTG_H_FS->HOST_EP_PID = 0;
    USBOTG_H_FS->INT_FG      = USBFS_UIF_TRANSFER;

    LOG_CH32_USBFSH("hcd_int_handler() pid_edpt=0x%02x status=0x%02x\r\n", pid_edpt, status);

    usb_edpt_t *edpt_info = get_edpt_record(dev_addr, ep_addr);
    if (edpt_info == NULL) {
      // Never hang the ISR on a missing record; report failure and drop the slot.
      LOG_CH32_USBFSH("hcd_int_handler() no record for dev=0x%02x ep=0x%02x\r\n", dev_addr, ep_addr);
      bool prev                     = usbfs_irq_save();
      usb_current_xfer_info.is_busy = false;
      usbfs_irq_restore(prev);
      hcd_event_xfer_complete(dev_addr, ep_addr, 0, XFER_RESULT_FAILED, in_isr);
      return;
    }

    // Hard routing by the slot's xfer_type snapshot: ISO and control/bulk take
    // disjoint completion paths. This is what prevents a control GET_DESCRIPTOR
    // IN from being completed through the ISO path with a stale RX_LEN.
    if (usb_current_xfer_info.xfer_type == TUSB_XFER_ISOCHRONOUS) {
      iso_transfer_complete(request_pid, edpt_info);
    } else {
      cb_transfer_complete(request_pid, response_pid, edpt_info, in_isr);
    }
  }
}

//--------------------------------------------------------------------+
// Endpoint API
//--------------------------------------------------------------------+

