hathach/tinyusb/src/portable/wch/hcd_ch32_usbfs.c
bool hcd_edpt_open(uint8_t rhport, uint8_t dev_addr, const tusb_desc_endpoint_t *ep_desc) {
  (void)rhport;
  uint8_t  ep_addr         = ep_desc->bEndpointAddress;
  uint16_t max_packet_size = ep_desc->wMaxPacketSize;
  uint8_t  xfer_type       = ep_desc->bmAttributes.xfer;
  LOG_CH32_USBFSH("hcd_edpt_open(dev_addr=0x%02x, ep=0x%02x, mps=%d, type=%d)\r\n", dev_addr, ep_addr, max_packet_size,
                  xfer_type);

  while (usb_current_xfer_info.is_busy) {}

  if (tu_edpt_number(ep_addr) == 0x00) {
    TU_ASSERT(get_or_add_edpt_record(dev_addr, 0x00, max_packet_size, xfer_type) != NULL, false);
    TU_ASSERT(get_or_add_edpt_record(dev_addr, 0x80, max_packet_size, xfer_type) != NULL, false);
  } else {
    TU_ASSERT(get_or_add_edpt_record(dev_addr, ep_addr, max_packet_size, xfer_type) != NULL, false);
  }

  USBOTG_H_FS->HOST_CTRL |= USBFS_UH_PORT_EN;
  USBOTG_H_FS->HOST_SETUP |= USBFS_UH_SOF_EN;

  hardware_set_port_address_speed(dev_addr);

  return true;
}

bool hcd_edpt_close(uint8_t rhport, uint8_t dev_addr, uint8_t ep_addr) {
  (void)rhport;
  LOG_CH32_USBFSH("hcd_edpt_close(dev_addr=0x%02x, ep=0x%02x)\r\n", dev_addr, ep_addr);
  usb_edpt_t *edpt = get_edpt_record(dev_addr, ep_addr);
  if (edpt == NULL) {
    return false;
  }
  bool prev        = usbfs_irq_save();
  edpt->configured = false;
  edpt->iso_queued = false;
  edpt->iso_active = false;
  if (usb_current_xfer_info.is_busy && usb_current_xfer_info.dev_addr == dev_addr &&
      usb_current_xfer_info.ep_addr == ep_addr) {
    usb_current_xfer_info.is_busy = false;
    USBOTG_H_FS->HOST_EP_PID      = 0;
  }
  usbfs_irq_restore(prev);
  return true;
}

bool hcd_edpt_xfer(uint8_t rhport, uint8_t dev_addr, uint8_t ep_addr, uint8_t *buffer, uint16_t buflen) {
  (void)rhport;
  LOG_CH32_USBFSH("hcd_edpt_xfer(dev_addr=0x%02x, ep=0x%02x, len=%d)\r\n", dev_addr, ep_addr, buflen);

  usb_edpt_t *edpt_info = get_edpt_record(dev_addr, ep_addr);
  TU_ASSERT(edpt_info != NULL, false);

  if (edpt_info->xfer_type == TUSB_XFER_ISOCHRONOUS) {
    // ISO: park the request on the endpoint and let the SOF/TRANSFER drain arm
    // it at the frame boundary. Do NOT busy-wait or grab the in-flight slot —
    // an early same-frame re-submit must not starve the other direction.
    bool prev             = usbfs_irq_save();
    edpt_info->iso_buf    = buffer;
    edpt_info->iso_len    = buflen;
    edpt_info->iso_active = false;
    edpt_info->iso_queued = true; // publish last (release ordering vs the ISR)
    usbfs_irq_restore(prev);

    arm_iso_drain(false);
    return true;
  }

  // Control/bulk/interrupt: immediate arm. These only run during enumeration
  // (no ISO competing for the single slot), so the busy-wait is safe.
  while (usb_current_xfer_info.is_busy) {}

  hardware_set_port_address_speed(dev_addr);

  usb_current_xfer_info.is_busy     = true;
  usb_current_xfer_info.dev_addr    = dev_addr;
  usb_current_xfer_info.ep_addr     = ep_addr;
  usb_current_xfer_info.xfer_type   = edpt_info->xfer_type;
  usb_current_xfer_info.buffer      = buffer;
  usb_current_xfer_info.bufferlen   = buflen;
  usb_current_xfer_info.start_ms    = tusb_time_millis_api();
  usb_current_xfer_info.xferred_len = 0;

  edpt_info->nak_backoff = 1; // fresh transfer: reset the progressive NAK backoff

  if (tu_edpt_dir(ep_addr) == TUSB_DIR_IN) {
    LOG_CH32_USBFSH("hcd_edpt_xfer(): READ, dev=0x%02x, ep=0x%02x, len=%d\r\n", dev_addr, ep_addr, buflen);
    return hardware_start_xfer(USB_PID_IN, ep_addr, edpt_info->data_toggle, false);
  }

  LOG_CH32_USBFSH("hcd_edpt_xfer(): WRITE, dev=0x%02x, ep=0x%02x, len=%d\r\n", dev_addr, ep_addr, buflen);
  uint16_t copylen         = TU_MIN(edpt_info->max_packet_size, buflen);
  USBOTG_H_FS->HOST_TX_LEN = copylen;
  return hardware_start_xfer(USB_PID_OUT, ep_addr, edpt_info->data_toggle, false);
}

bool hcd_edpt_abort_xfer(uint8_t rhport, uint8_t dev_addr, uint8_t ep_addr) {
  (void)rhport;
  usb_edpt_t *edpt = get_edpt_record(dev_addr, ep_addr);
  if (edpt == NULL) {
    return false;
  }

  bool prev    = usbfs_irq_save();
  bool aborted = false;

  if (edpt->xfer_type == TUSB_XFER_ISOCHRONOUS) {
    // Only a queued (not-yet-started) ISO transfer can be aborted.
    if (edpt->iso_queued && !edpt->iso_active) {
      edpt->iso_queued = false;
      aborted          = true;
    }
  } else {
    // For control/bulk/interrupt: abort the in-flight transfer if it belongs
    // to this endpoint.
    if (usb_current_xfer_info.is_busy &&
        usb_current_xfer_info.dev_addr == dev_addr &&
        usb_current_xfer_info.ep_addr == ep_addr) {
      USBOTG_H_FS->HOST_EP_PID      = 0;
      usb_current_xfer_info.is_busy = false;
      edpt->is_nak_pending          = false;
      aborted                       = true;
    }
  }
  usbfs_irq_restore(prev);
  return aborted;
}

bool hcd_setup_send(uint8_t rhport, uint8_t dev_addr, const uint8_t setup_packet[8]) {
  (void)rhport;

  while (usb_current_xfer_info.is_busy) {}

  usb_current_xfer_info.is_busy = true;

  LOG_CH32_USBFSH("hcd_setup_send(dev_addr=0x%02x)\r\n", dev_addr);

  hardware_set_port_address_speed(dev_addr);

  usb_edpt_t *edpt_info_tx = get_edpt_record(dev_addr, 0x00);
  usb_edpt_t *edpt_info_rx = get_edpt_record(dev_addr, 0x80);
  TU_ASSERT(edpt_info_tx != NULL, false);
  TU_ASSERT(edpt_info_rx != NULL, false);

  // SETUP always starts with DATA0 (OUT toggle). A control read's first data
  // packet is DATA1, so the IN endpoint toggle must be primed to DATA1 here.
  edpt_info_tx->data_toggle           = 0;
  edpt_info_rx->data_toggle           = 0x01;
  const uint16_t setup_packet_datalen = 8;
  memcpy(USBFS_TX_Buf, setup_packet, setup_packet_datalen);
  USBOTG_H_FS->HOST_TX_LEN          = setup_packet_datalen;
  uint8_t ep_addr                   = (setup_packet[0] & 0x80) ? 0x80 : 0x00;
  usb_current_xfer_info.dev_addr    = dev_addr;
  usb_current_xfer_info.ep_addr     = ep_addr;
  usb_current_xfer_info.xfer_type   = TUSB_XFER_CONTROL;
  usb_current_xfer_info.start_ms    = tusb_time_millis_api();
  usb_current_xfer_info.buffer      = USBFS_TX_Buf;
  usb_current_xfer_info.bufferlen   = setup_packet_datalen;
  usb_current_xfer_info.xferred_len = 0;

  hardware_start_xfer(USB_PID_SETUP, 0, 0, false);
  return true;
}

bool hcd_edpt_clear_stall(uint8_t rhport, uint8_t dev_addr, uint8_t ep_addr) {
  (void)rhport;
  LOG_CH32_USBFSH("hcd_edpt_clear_stall(dev_addr=0x%02x, ep=0x%02x)\r\n", dev_addr, ep_addr);
  usb_edpt_t *edpt = get_edpt_record(dev_addr, ep_addr);
  if (edpt == NULL) {
    return false;
  }
  bool prev = usbfs_irq_save();
  edpt->data_toggle = 0;
  usbfs_irq_restore(prev);
  return true;
}

#endif
